#pragma once//директива препроцесора, щоб уникнути багаторазове ключання модулів
#include "Time.h"

clock_t Sort_5(int p, int m, int n);
/*Функція що сортує масив методом прямого вибору*/

clock_t Sort_6(int p, int m, int n);
/*Функція що сортує масив методом прямого вибору №2 */

clock_t Sort_18(int p, int m, int n);
/*Функція гібридного алгоритму "Вибір№1 - Обмін "*/

clock_t Sort_19(int p, int m, int n);
/*Функція гібридного алгоритму "Вибір№2 - Обмін"*/

//перелік прототипів функцій, які будемо досліджувати